Amiya200/stm32_water_tank/Core/Src/screen.c
    snprintf(l1, sizeof(l1), "Water:%s", level);

    lcd_line0(l0);
    lcd_line1(l1);
}

/***************************************************************
 *  END OF PART 1 — continue with PART 2 next
 ***************************************************************/
/***************************************************************
 *  SCREEN.C — PART 2 OF 4
 *  UI Screens + Timer/Auto/Twist/Countdown Apply Functions
 ***************************************************************/

/* ---------------- MENU RENDERING ---------------- */

static void format_menu_line(char* buf,size_t size,int idx,bool sel){
    if (idx < 0 || idx >= MAIN_MENU_COUNT){
        snprintf(buf,size,"                ");
        return;
    }
    snprintf(buf,size,"%c%-15.15s", sel?'>':' ', main_menu[idx]);
}

static void show_menu(void){
    char l0[17], l1[17];

    if (menu_idx < menu_view_top)
        menu_view_top = menu_idx;
    else if (menu_idx > menu_view_top+1)
        menu_view_top = menu_idx - 1;

    format_menu_line(l0, sizeof(l0), menu_view_top,
                     cursorVisible && menu_idx==menu_view_top);

    format_menu_line(l1, sizeof(l1), menu_view_top+1,
                     cursorVisible && menu_idx==menu_view_top+1);

    lcd_line0(l0);
    lcd_line1(l1);
}

/* ---------------- MANUAL MODE DISPLAY ---------------- */

static void show_manual(void){
    lcd_line0("Manual Mode");
    lcd_line1(Motor_GetStatus() ? "val:STOP    Next>" :
                                  "val:START   Next>");
}

/* ---------------- AUTO MODE MENU ---------------- */

static void show_auto_menu(void){
    lcd_line0("Auto Settings");
    lcd_line1(">Gap/Max/Retry");
}

static void show_auto_gap(void){
    lcd_line0("DRY GAP (s)");
    lcd_val_next(edit_auto_gap_s);
}

static void show_auto_maxrun(void){
    lcd_line0("MAX RUN (min)");
    lcd_val_next(edit_auto_maxrun_min);
}

static void show_auto_retry(void){
    lcd_line0("RETRY COUNT");
    lcd_val_next(edit_auto_retry);
}

/* ---------------- SEMI AUTO ---------------- */

static void show_semi_auto(void){
    lcd_line0("Semi-Auto");
    lcd_line1(semiAutoActive ? "val:Disable Next>" :
                               "val:Enable  Next>");
}

/* ---------------- TIMER DISPLAY ---------------- */

static void show_timer(void){
    char l0[17];
    TimerSlot* t = &timerSlots[currentSlot];
    snprintf(l0,sizeof(l0),"Slot %d %02d:%02d-%02d:%02d",
             currentSlot+1,
             t->onHour,t->onMinute,
             t->offHour,t->offMinute);
    lcd_line0(l0);
    lcd_line1("val:Edit   Next>");
}

static void show_timer_on_h(void){
    lcd_line0("TIMER ON HOUR");
    lcd_val_next(edit_timer_on_h);
}

static void show_timer_on_m(void){
    lcd_line0("TIMER ON MIN");
    lcd_val_next(edit_timer_on_m);
}

static void show_timer_off_h(void){
    lcd_line0("TIMER OFF HOUR");
    lcd_val_next(edit_timer_off_h);
}

static void show_timer_off_m(void){
    lcd_line0("TIMER OFF MIN");
    lcd_val_next(edit_timer_off_m);
}

/* ---------------- TWIST MODE DISPLAY ---------------- */

static void show_twist(void){
    char l0[17];
    snprintf(l0,sizeof(l0),"Tw %02ds/%02ds",
             twistSettings.onDurationSeconds,
             twistSettings.offDurationSeconds);
    lcd_line0(l0);
    lcd_line1(twistActive ? "val:STOP   Next>" :
                            "val:START  Next>");
}

static void show_twist_on_sec(void){
    lcd_line0("TWIST ON SEC");
    lcd_val_next(edit_twist_on_s);
}

static void show_twist_off_sec(void){
    lcd_line0("TWIST OFF SEC");
    lcd_val_next(edit_twist_off_s);
}

static void show_twist_on_h(void){
    lcd_line0("TWIST ON HH");
    lcd_val_next(edit_twist_on_hh);
}

static void show_twist_on_m(void){
    lcd_line0("TWIST ON MM");
    lcd_val_next(edit_twist_on_mm);
}

static void show_twist_off_h(void){
    lcd_line0("TWIST OFF HH");
    lcd_val_next(edit_twist_off_hh);
}

static void show_twist_off_m(void){
    lcd_line0("TWIST OFF MM");
    lcd_val_next(edit_twist_off_mm);
}

/* ---------------- COUNTDOWN DISPLAY ---------------- */

static void show_countdown(void){
    char l0[17], l1[17];

    if (countdownActive){
        uint32_t sec = countdownDuration;
        uint32_t min = sec/60;
        uint32_t s   = sec%60;
        snprintf(l0,sizeof(l0),"CD %02u:%02u RUN",min,s);
        snprintf(l1,sizeof(l1),"Press to STOP");
    }
    else{
        snprintf(l0,sizeof(l0),"CD Set:%3u min",edit_countdown_min);
        snprintf(l1,sizeof(l1),"Press to START");
    }
    lcd_line0(l0);
    lcd_line1(l1);
}

static void show_countdown_edit_min(void){
    lcd_line0("SET MINUTES");
    lcd_val_next(edit_countdown_min);
}

/* ================================================================
   APPLY FUNCTIONS — TIMER / AUTO / TWIST / COUNTDOWN
   ================================================================ */

static void apply_timer_settings(void){
    TimerSlot *t = &timerSlots[currentSlot];
    t->enabled  = true;
    t->onHour   = edit_timer_on_h;
    t->onMinute = edit_timer_on_m;
    t->offHour  = edit_timer_off_h;
    t->offMinute= edit_timer_off_m;

    extern void ModelHandle_TimerRecalculateNow(void);
    ModelHandle_TimerRecalculateNow();
}

static void apply_auto_settings(void){
    ModelHandle_SetAutoSettings(
        edit_auto_gap_s,
        edit_auto_maxrun_min,
        edit_auto_retry
    );
}

static void apply_twist_settings(void){
    twistSettings.onDurationSeconds  = edit_twist_on_s;
    twistSettings.offDurationSeconds = edit_twist_off_s;

    twistSettings.onHour   = edit_twist_on_hh;
    twistSettings.onMinute = edit_twist_on_mm;
    twistSettings.offHour  = edit_twist_off_hh;
    twistSettings.offMinute= edit_twist_off_mm;
}

static void apply_countdown_settings(void){
    countdownDuration = (uint32_t)edit_countdown_min * 60u;
}

/* ================================================================
   EDIT FIELD INCREASE / DECREASE
   ================================================================ */

static void increase_edit_value(void){
    switch(ui)
    {
        case UI_TIMER_EDIT_SLOT_ON_H:
            edit_timer_on_h = (edit_timer_on_h + 1) % 24; break;

        case UI_TIMER_EDIT_SLOT_ON_M:
            edit_timer_on_m = (edit_timer_on_m + 1) % 60; break;

        case UI_TIMER_EDIT_SLOT_OFF_H:
            edit_timer_off_h = (edit_timer_off_h + 1) % 24; break;

        case UI_TIMER_EDIT_SLOT_OFF_M:
            edit_timer_off_m = (edit_timer_off_m + 1) % 60; break;

