Amiya200/stm32_water_tank/Core/Src/screen.c
        case UI_AUTO_EDIT_GAP:
            edit_auto_gap_s++; break;

        case UI_AUTO_EDIT_MAXRUN:
            edit_auto_maxrun_min++; break;

        case UI_AUTO_EDIT_RETRY:
            edit_auto_retry++; break;

        case UI_TWIST_EDIT_ON:
            if (++edit_twist_on_s > 999) edit_twist_on_s = 0; break;

        case UI_TWIST_EDIT_OFF:
            if (++edit_twist_off_s > 999) edit_twist_off_s = 0; break;

        case UI_TWIST_EDIT_ON_H:
            edit_twist_on_hh = (edit_twist_on_hh + 1) % 24; break;

        case UI_TWIST_EDIT_ON_M:
            edit_twist_on_mm = (edit_twist_on_mm + 1) % 60; break;

        case UI_TWIST_EDIT_OFF_H:
            edit_twist_off_hh = (edit_twist_off_hh + 1) % 24; break;

        case UI_TWIST_EDIT_OFF_M:
            edit_twist_off_mm = (edit_twist_off_mm + 1) % 60; break;

        case UI_COUNTDOWN_EDIT_MIN:
            if (++edit_countdown_min > 999)
                edit_countdown_min = 1;
            break;

        default: break;
    }
}

static void decrease_edit_value(void){
    switch(ui)
    {
        case UI_TIMER_EDIT_SLOT_ON_H:
            edit_timer_on_h = (edit_timer_on_h==0)?23:edit_timer_on_h-1; break;

        case UI_TIMER_EDIT_SLOT_ON_M:
            edit_timer_on_m = (edit_timer_on_m==0)?59:edit_timer_on_m-1; break;

        case UI_TIMER_EDIT_SLOT_OFF_H:
            edit_timer_off_h = (edit_timer_off_h==0)?23:edit_timer_off_h-1; break;

        case UI_TIMER_EDIT_SLOT_OFF_M:
            edit_timer_off_m = (edit_timer_off_m==0)?59:edit_timer_off_m-1; break;

        case UI_AUTO_EDIT_GAP:
            if (edit_auto_gap_s>0) edit_auto_gap_s--; break;

        case UI_AUTO_EDIT_MAXRUN:
            if (edit_auto_maxrun_min>0) edit_auto_maxrun_min--; break;

        case UI_AUTO_EDIT_RETRY:
            if (edit_auto_retry>0) edit_auto_retry--; break;

        case UI_TWIST_EDIT_ON:
            edit_twist_on_s = (edit_twist_on_s==0)?999:edit_twist_on_s-1; break;

        case UI_TWIST_EDIT_OFF:
            edit_twist_off_s = (edit_twist_off_s==0)?999:edit_twist_off_s-1; break;

        case UI_TWIST_EDIT_ON_H:
            edit_twist_on_hh = (edit_twist_on_hh==0)?23:edit_twist_on_hh-1; break;

        case UI_TWIST_EDIT_ON_M:
            edit_twist_on_mm = (edit_twist_on_mm==0)?59:edit_twist_on_mm-1; break;

        case UI_TWIST_EDIT_OFF_H:
            edit_twist_off_hh = (edit_twist_off_hh==0)?23:edit_twist_off_hh-1; break;

        case UI_TWIST_EDIT_OFF_M:
            edit_twist_off_mm = (edit_twist_off_mm==0)?59:edit_twist_off_mm-1; break;

        case UI_COUNTDOWN_EDIT_MIN:
            edit_countdown_min = (edit_countdown_min==1)?999:edit_countdown_min-1;
            break;

        default: break;
    }
}
/* ================================================================
   MENU SELECT HANDLER (SW2 SHORT)
   ================================================================ */

static void goto_menu_top(void){
    menu_idx = 0;
    menu_view_top = 0;
}

static void menu_select(void){
    refreshInactivityTimer();

    switch(ui)
    {
        case UI_WELCOME:
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case UI_DASH:
            ui = UI_MENU;
            goto_menu_top();
            screenNeedsRefresh = true;
            return;

        case UI_MENU:
            switch(menu_idx)
            {
                case 0: ui = UI_TIMER; currentSlot = 0; break;
                case 1: ui = UI_AUTO_MENU; break;
                case 2: ui = UI_TWIST; break;
                case 3: ui = UI_DASH; break;
                case 4: ui = UI_DASH; break;
            }
            screenNeedsRefresh = true;
            return;

        /* TIMER EDIT FLOW ---------------------------- */
        case UI_TIMER:
            ui = UI_TIMER_EDIT_SLOT_ON_H; screenNeedsRefresh = true; return;

        case UI_TIMER_EDIT_SLOT_ON_H:
            ui = UI_TIMER_EDIT_SLOT_ON_M; screenNeedsRefresh = true; return;

        case UI_TIMER_EDIT_SLOT_ON_M:
            ui = UI_TIMER_EDIT_SLOT_OFF_H; screenNeedsRefresh = true; return;

        case UI_TIMER_EDIT_SLOT_OFF_H:
            ui = UI_TIMER_EDIT_SLOT_OFF_M; screenNeedsRefresh = true; return;

        case UI_TIMER_EDIT_SLOT_OFF_M:
            apply_timer_settings();
            ui = UI_TIMER;
            screenNeedsRefresh = true;
            return;

        /* AUTO EDIT FLOW ----------------------------- */
        case UI_AUTO_MENU:
            ui = UI_AUTO_EDIT_GAP; screenNeedsRefresh = true; return;

        case UI_AUTO_EDIT_GAP:
            ui = UI_AUTO_EDIT_MAXRUN; screenNeedsRefresh = true; return;

        case UI_AUTO_EDIT_MAXRUN:
            ui = UI_AUTO_EDIT_RETRY; screenNeedsRefresh = true; return;

        case UI_AUTO_EDIT_RETRY:
            apply_auto_settings();
            ui = UI_AUTO_MENU;
            screenNeedsRefresh = true;
            return;

        /* TWIST EDIT FLOW ----------------------------- */
        case UI_TWIST:
            ui = UI_TWIST_EDIT_ON; screenNeedsRefresh = true; return;

        case UI_TWIST_EDIT_ON:
            ui = UI_TWIST_EDIT_OFF; screenNeedsRefresh = true; return;

        case UI_TWIST_EDIT_OFF:
            ui = UI_TWIST_EDIT_ON_H; screenNeedsRefresh = true; return;

        case UI_TWIST_EDIT_ON_H:
            ui = UI_TWIST_EDIT_ON_M; screenNeedsRefresh = true; return;

        case UI_TWIST_EDIT_ON_M:
            ui = UI_TWIST_EDIT_OFF_H; screenNeedsRefresh = true; return;

        case UI_TWIST_EDIT_OFF_H:
            ui = UI_TWIST_EDIT_OFF_M; screenNeedsRefresh = true; return;

        case UI_TWIST_EDIT_OFF_M:
            apply_twist_settings();
            ui = UI_TWIST;
            screenNeedsRefresh = true;
            return;

        /* COUNTDOWN EDIT FLOW -------------------------- */
        case UI_COUNTDOWN:
            if (countdownActive){
                ModelHandle_StopCountdown();
                screenNeedsRefresh = true;
            } else {
                ui = UI_COUNTDOWN_EDIT_MIN;
                screenNeedsRefresh = true;
            }
            return;

        case UI_COUNTDOWN_EDIT_MIN:
            apply_countdown_settings();
            ui = UI_COUNTDOWN;
            screenNeedsRefresh = true;
            return;

        default:
            return;
    }
}

/***************************************************************
 *  END OF PART 2 — Request PART 3 for button handling
 ***************************************************************/
/***************************************************************
 *  SCREEN.C — PART 3 OF 4
 *  Button Handling + Mode Logic + Countdown Fix
 ***************************************************************/

/* ================================================================
   BUTTON DECODER (robust long-press handling)
   ================================================================ */

static UiButton decode_button_press(void){
    bool sw1 = Switch_IsPressed(0);
    bool sw2 = Switch_IsPressed(1);
    bool sw3 = Switch_IsPressed(2);
    bool sw4 = Switch_IsPressed(3);

    bool sw[4] = {sw1, sw2, sw3, sw4};
    uint32_t now = HAL_GetTick();
    UiButton out = BTN_NONE;

    for (int i = 0; i < 4; i++)
    {
        /* -------------------- PRESS START --------------------- */
        if (sw[i] && sw_press_start[i] == 0)
        {
            sw_press_start[i] = now;
            sw_long_issued[i] = false;
        }
        /* -------------------- RELEASE = SHORT PRESS ----------- */
        else if (!sw[i] && sw_press_start[i] != 0)
        {
            if (!sw_long_issued[i])
            {
                switch(i){
                    case 0: out = BTN_RESET;  break;
                    case 1: out = BTN_SELECT; break;
                    case 2: out = BTN_UP;     break;
                    case 3: out = BTN_DOWN;   break;
                }
            }
            sw_press_start[i]  = 0;
            sw_long_issued[i]  = false;
        }
        /* -------------------- HOLD = LONG PRESS --------------- */
        else if (sw[i] && !sw_long_issued[i])
        {
            if (now - sw_press_start[i] >= LONG_PRESS_MS)
            {
                sw_long_issued[i] = true;
                switch(i){
                    case 0: out = BTN_RESET_LONG;  break;
                    case 1: out = BTN_SELECT_LONG; break;
                    case 2: out = BTN_UP_LONG;     break;
                    case 3: out = BTN_DOWN_LONG;   break;
                }
            }
        }
    }

    return out;
}

/* ================================================================
   MAIN BUTTON HANDLER — NEW FINAL FLOW
   ================================================================ */

void Screen_HandleSwitches(void)
{
    UiButton b = decode_button_press();
    if (b == BTN_NONE) return;

    refreshInactivityTimer();

    /* ---------------- IDENTIFY IF WE ARE IN A MENU ------------ */
    bool inMenu =
        (ui == UI_MENU ||
         ui == UI_TIMER ||
         ui == UI_TIMER_SLOT_SELECT ||
         ui == UI_AUTO_MENU ||
         ui == UI_TWIST ||
         ui == UI_SEMI_AUTO ||
         ui == UI_MANUAL ||
         ui == UI_COUNTDOWN_EDIT_MIN ||
         ui == UI_TIMER_EDIT_SLOT_ON_H || ui == UI_TIMER_EDIT_SLOT_ON_M ||
         ui == UI_TIMER_EDIT_SLOT_OFF_H || ui == UI_TIMER_EDIT_SLOT_OFF_M ||
         ui == UI_AUTO_EDIT_GAP || ui == UI_AUTO_EDIT_MAXRUN ||
         ui == UI_AUTO_EDIT_RETRY ||
         ui == UI_TWIST_EDIT_ON || ui == UI_TWIST_EDIT_OFF ||
         ui == UI_TWIST_EDIT_ON_H || ui == UI_TWIST_EDIT_ON_M ||
         ui == UI_TWIST_EDIT_OFF_H || ui == UI_TWIST_EDIT_OFF_M);

    bool dashboardMode =
        (ui == UI_DASH || ui == UI_COUNTDOWN);

    /* ===========================================================
       NORMAL MODE BUTTON FLOW  (Not inside menu)
       =========================================================== */
    if (!inMenu)
    {
        switch(b)
        {
            /* -----------------------------------------------------
               SW1 SHORT → RESTART MOTOR IMMEDIATELY
               ----------------------------------------------------- */
            case BTN_RESET:
                ModelHandle_SetMotor(true);
                screenNeedsRefresh = true;
                return;

            /* -----------------------------------------------------
               SW1 LONG → TOGGLE MANUAL MODE
               ----------------------------------------------------- */
            case BTN_RESET_LONG:
                ModelHandle_ToggleManual();
                ui = UI_MANUAL;
                screenNeedsRefresh = true;
                return;

            /* -----------------------------------------------------
               SW2 SHORT → TOGGLE AUTO MODE
               ----------------------------------------------------- */
            case BTN_SELECT:
                if (autoActive)
                {
                    autoActive = false;
                    ModelHandle_StopAllModesAndMotor();
                }
                else
                {
                    autoActive = true;
                }
                screenNeedsRefresh = true;
                return;

            /* -----------------------------------------------------
               SW2 LONG → OPEN MAIN MENU
               ----------------------------------------------------- */
            case BTN_SELECT_LONG:
                ui = UI_MENU;
                menu_idx = 0;
                screenNeedsRefresh = true;
                return;

            /* -----------------------------------------------------
               SW3 SHORT → Start TIMER MODE (nearest slot)
               ----------------------------------------------------- */
            case BTN_UP:
                ModelHandle_StartTimer();
                ui = UI_TIMER;
                screenNeedsRefresh = true;
                return;

            /* -----------------------------------------------------
               SW3 LONG → TOGGLE SEMI AUTO
               ----------------------------------------------------- */
            case BTN_UP_LONG:
                if (semiAutoActive)
                    ModelHandle_StopSemiAuto();
                else
                    ModelHandle_StartSemiAuto();

