Amiya200/stm32_water_tank/Core/Src/screen.c
                ui = UI_SEMI_AUTO;
                screenNeedsRefresh = true;
                return;

            /* -----------------------------------------------------
               SW4 SHORT → START/STOP COUNTDOWN
               ----------------------------------------------------- */
            case BTN_DOWN:

                if (!countdownActive)
                    ModelHandle_StartCountdown(edit_countdown_min * 60);
                else
                    ModelHandle_StopCountdown();

                ui = UI_COUNTDOWN;
                screenNeedsRefresh = true;
                return;

            /* -----------------------------------------------------
               SW4 LONG → ENTER EDIT + CONTINUOUS INCREMENT
               ----------------------------------------------------- */
            case BTN_DOWN_LONG:

                ui = UI_COUNTDOWN_EDIT_MIN;

                if (HAL_GetTick() - last_repeat_time > COUNTDOWN_INC_MS)
                {
                    last_repeat_time = HAL_GetTick();
                    edit_countdown_min = (edit_countdown_min + 1) % 999;
                    screenNeedsRefresh = true;
                }
                return;

            default:
                break;
        }
    }

    /* ===========================================================
       MENU MODE BUTTON FLOW  (while editing)
       =========================================================== */
    switch(b)
    {
        /* ---------------------- BACK --------------------- */
        case BTN_RESET:
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* ---------------------- ENTER / SELECT ------------ */
        case BTN_SELECT:
            menu_select();
            return;

        /* ---------------------- UP ------------------------ */
        case BTN_UP:
            if (ui == UI_MENU)
            {
                if (menu_idx > 0) menu_idx--;
                screenNeedsRefresh = true;
            }
            else
            {
                increase_edit_value();
                screenNeedsRefresh = true;
            }
            return;

        case BTN_UP_LONG:
            if (HAL_GetTick() - last_repeat_time > CONTINUOUS_STEP_MS)
            {
                last_repeat_time = HAL_GetTick();
                increase_edit_value();
                screenNeedsRefresh = true;
            }
            return;

        /* ---------------------- DOWN ---------------------- */
        case BTN_DOWN:
            if (ui == UI_MENU)
            {
                if (menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
                screenNeedsRefresh = true;
            }
            else
            {
                decrease_edit_value();
                screenNeedsRefresh = true;
            }
            return;

        case BTN_DOWN_LONG:
            if (HAL_GetTick() - last_repeat_time > CONTINUOUS_STEP_MS)
            {
                last_repeat_time = HAL_GetTick();
                decrease_edit_value();
                screenNeedsRefresh = true;
            }
            return;

        default:
            return;
    }
}

/***************************************************************
 *  SCREEN.C — PART 4 OF 4
 *  LCD Update Engine + Final Rendering
 ***************************************************************/

void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();

    /* ============================================================
       Determine if cursor blink is active
       ============================================================ */
    bool cursorBlinkActive = false;

    switch(ui)
    {
        case UI_MENU:
        case UI_TIMER_EDIT_SLOT_ON_H:
        case UI_TIMER_EDIT_SLOT_ON_M:
        case UI_TIMER_EDIT_SLOT_OFF_H:
        case UI_TIMER_EDIT_SLOT_OFF_M:
        case UI_COUNTDOWN_EDIT_MIN:
        case UI_TWIST_EDIT_ON:
        case UI_TWIST_EDIT_OFF:
        case UI_TWIST_EDIT_ON_H:
        case UI_TWIST_EDIT_ON_M:
        case UI_TWIST_EDIT_OFF_H:
        case UI_TWIST_EDIT_OFF_M:
        case UI_AUTO_EDIT_GAP:
        case UI_AUTO_EDIT_MAXRUN:
        case UI_AUTO_EDIT_RETRY:
            cursorBlinkActive = true;
            break;

        default:
            cursorBlinkActive = false;
            cursorVisible = true;
            break;
    }

    /* Handle cursor blinking */
    if (cursorBlinkActive && (now - lastCursorToggle >= CURSOR_BLINK_MS))
    {
        cursorVisible = !cursorVisible;
        lastCursorToggle = now;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       Auto-transition from WELCOME → DASH
       ============================================================ */
    if (ui == UI_WELCOME && now - lastLcdUpdateTime >= WELCOME_MS)
    {
        ui = UI_DASH;
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       Auto-return to DASH after 60s inactivity
       ============================================================ */
    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        now - lastUserAction >= AUTO_BACK_MS)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       Refresh dashboard every second
       ============================================================ */
    if (ui == UI_DASH && (now - lastLcdUpdateTime >= 1000))
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       Perform LCD Refresh
       ============================================================ */
    if (screenNeedsRefresh || ui != last_ui)
    {
        bool fullRefresh = (ui != last_ui);
        last_ui = ui;
        screenNeedsRefresh = false;

        if (fullRefresh)
            lcd_clear();

        switch(ui)
        {
            case UI_WELCOME:                show_welcome(); break;
            case UI_DASH:                   show_dash(); break;

            case UI_MENU:                   show_menu(); break;

            case UI_MANUAL:                 show_manual(); break;
            case UI_SEMI_AUTO:              show_semi_auto(); break;

            case UI_TIMER:                  show_timer(); break;
            case UI_TIMER_EDIT_SLOT_ON_H:   show_timer_on_h(); break;
            case UI_TIMER_EDIT_SLOT_ON_M:   show_timer_on_m(); break;
            case UI_TIMER_EDIT_SLOT_OFF_H:  show_timer_off_h(); break;
            case UI_TIMER_EDIT_SLOT_OFF_M:  show_timer_off_m(); break;

            case UI_AUTO_MENU:              show_auto_menu(); break;
            case UI_AUTO_EDIT_GAP:          show_auto_gap(); break;
            case UI_AUTO_EDIT_MAXRUN:       show_auto_maxrun(); break;
            case UI_AUTO_EDIT_RETRY:        show_auto_retry(); break;

            case UI_COUNTDOWN:              show_countdown(); break;
            case UI_COUNTDOWN_EDIT_MIN:     show_countdown_edit_min(); break;

            case UI_TWIST:                  show_twist(); break;
            case UI_TWIST_EDIT_ON:          show_twist_on_sec(); break;
            case UI_TWIST_EDIT_OFF:         show_twist_off_sec(); break;
            case UI_TWIST_EDIT_ON_H:        show_twist_on_h(); break;
            case UI_TWIST_EDIT_ON_M:        show_twist_on_m(); break;
            case UI_TWIST_EDIT_OFF_H:       show_twist_off_h(); break;
            case UI_TWIST_EDIT_OFF_M:       show_twist_off_m(); break;

            default:
                lcd_line0("Not Impl");
                lcd_line1(" ");
                break;
        }
    }
}

/***************************************************************
 *  END OF SCREEN.C (ALL PARTS COMPLETE)
 ***************************************************************/
